Repository: massidea/site
Catalog: application/languages/innovationtypes.tmx
Source language: fi
Languages: en

source: Innovaatiotyyppi
en: Innovation type

source: Tuoteinnovaatio
en: Product innovation

source: Kehitysinnovaatio
en: Process innovation

source: Järjestelyinnovaatio
en: Organisational innovation

source: Rakenneinnovaatio
en: Structural innovation

source: Markkinaininnovaatio
en: Market innovation
